[
  {
    "message": "Becoming a doctor can be a challenging but rewarding career path. If you're currently in your second year of Intermediate (Class 12th), here's a step-by-step guide to help you get started:\n\n**Step 1: Complete your Intermediate (Class 12th) and Senior Secondary Education**\n\n* Focus on scoring well in your upcoming board exams, especially in subjects like Biology, Chemistry, Physics, and English.\n* Aim for a high percentage, as this will increase your chances of getting accepted into a good medical college.\n\n**Step 2: Take the Medical Entrance Exams**\n\n* In India, there are several medical entrance exams that you can take, such as:\n\t+ NEET (National Eligibility cum Entrance Test)\n\t+ AIIMS (All India Institute of Medical Sciences) Entrance Exam\n\t+ JIPMER (Jawaharlal Institute of Postgraduate Medical Education and Research) Entrance Exam\n\t+ COMEDK (Consortium of Medical, Engineering and Dental Colleges of Karnataka) UGET\n* Prepare well for these exams by studying hard and taking mock tests to improve your timing and accuracy.\n\n**Step 3: Pursue a Bachelor's Degree in Medicine (MBBS)**\n\n* If you pass the medical entrance exams, you'll be eligible to apply for undergraduate medical programs like MBBS (Bachelor of Medicine, Bachelor of Surgery).\n* MBBS is a five-and-a-half-year undergraduate program that includes one year of internship.\n* You can apply for MBBS programs in government or private medical colleges.\n\n**Step 4: Complete Clinical Rotations and Internship**\n\n* During your final year of MBBS, you'll undergo clinical rotations in various specialties, such as surgery, medicine, pediatrics, and more.\n* This hands-on experience will help you gain practical knowledge and skills in your chosen field.\n* After completing clinical rotations, you'll undergo a one-year internship, which is mandatory for all MBBS students.\n\n**Step 5: Pursue Postgraduate Studies (Optional)**\n\n* If you want to specialize in a particular field, you'll need to pursue postgraduate studies like MD (Doctor of Medicine) or MS (Master of Surgery).\n* Postgraduate studies typically take three to five years to complete and require a bachelor's degree in medicine (MBBS) as a minimum qualification.\n\n**Step 6: Obtain a Medical License**\n\n* After completing your MBBS and internship, you'll need to register with the Medical Council of India (MCI) or the concerned state medical council to obtain a medical license.\n* This license is necessary to practice medicine in your country or state.\n\n**Additional Tips**\n\n* Stay focused and motivated throughout your academic journey.\n* Build a strong foundation in sciences, especially Biology, Chemistry, and Physics.\n* Consider taking up internships or volunteering opportunities in hospitals or healthcare settings to gain practical experience.\n* Stay updated with the latest medical trends and advancements by reading medical journals and attending conferences.\n\nRemember, becoming a doctor requires dedication, hard work, and perseverance. Stay committed to your goals, and you'll be well on your way to achieving them!",
    "feedback": "down"
  },
  {
    "message": "Becoming a doctor is a challenging yet rewarding career path that requires dedication, hard work, and a passion for helping others. Here's a step-by-step guide to help you get started:<br><br>**Step 1: Earn a Bachelor's Degree (Typically 4 Years)**<br><br><br>▪ Most medical schools require applicants to have a bachelor's degree, typically in a science-related field like biology, chemistry, or physics.<br><br>▪ Take pre-med courses, such as:<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Biology<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Chemistry<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Organic Chemistry<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Physics<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Biochemistry<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Mathematics<br>\t<br>&nbsp;&nbsp;&nbsp;➤ English<br><br>**Step 2: Take the Medical College Admission Test (MCAT)**<br><br><br>▪ The MCAT is a standardized exam that tests your knowledge in sciences, critical thinking, and problem-solving skills.<br><br>▪ Prepare well for the exam by taking practice tests, attending prep courses, and reviewing study materials.<br><br>**Step 3: Attend Medical School (Typically 4 Years)**<br><br><br>▪ Apply to medical schools that are accredited by the Liaison Committee on Medical Education (LCME).<br><br>▪ Complete four years of medical school, which includes:<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Classroom instruction<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Clinical rotations<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Research projects<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Electives<br><br>**Step 4: Complete Clinical Rotations (Typically 2 Years)**<br><br><br>▪ During your final two years of medical school, you'll participate in clinical rotations, where you'll work under the supervision of experienced physicians in various specialties.<br><br>**Step 5: Earn a Medical Degree (MD) or Doctor of Osteopathic Medicine (DO)**<br><br><br>▪ Upon completing medical school, you'll be awarded an MD or DO degree.<br><br>**Step 6: Complete Residency Training (Typically 3-7 Years)**<br><br><br>▪ After medical school, you'll need to complete a residency program, which can last from three to seven years, depending on the specialty.<br><br>▪ During this time, you'll work under the supervision of experienced physicians to gain hands-on experience in your chosen specialty.<br><br>**Step 7: Obtain Licensure and Certification**<br><br><br>▪ To practice medicine, you'll need to obtain a medical license in the state where you plan to work.<br><br>▪ You'll also need to obtain certification from a professional medical organization, such as the American Board of Medical Specialties (ABMS).<br><br>**Step 8: Pursue Additional Training (Optional)**<br><br><br>▪ If you want to specialize in a particular area, you may need to complete additional training through fellowship programs, which can last one to three years.<br><br>**Step 9: Maintain Certification and Licensure**<br><br><br>▪ To stay certified and licensed, you'll need to complete continuing medical education (CME) courses, stay up-to-date with the latest medical knowledge, and adhere to professional standards.<br><br>Remember, becoming a doctor requires dedication, hard work, and a passion for helping others. Stay focused, and you'll be well on your way to achieving your goal!",
    "feedback": "up"
  },
  {
    "message": "Here's a roadmap to become a doctor in the United States:<br><br>**Step 1: Earn a Bachelor's Degree (Typically 4 Years)**<br><br><br>▪ Enroll in a pre-med or science-related undergraduate program at a college or university<br><br>▪ Take courses in biology, chemistry, physics, and mathematics to meet pre-med requirements<br><br>▪ Maintain a strong GPA, as medical schools are competitive<br><br>▪ Prepare for and take the Medical College Admission Test (MCAT) during junior or senior year<br><br>**Step 2: Attend Medical School (Typically 4 Years)**<br><br><br>▪ Apply to medical schools through the American Medical College Application Service (AMCAS)<br><br>▪ Complete a Doctor of Medicine (M.D.) or Doctor of Osteopathic Medicine (D.O.) program<br><br>▪ Complete clinical rotations in various specialties during the final two years of medical school<br><br>▪ Pass comprehensive exams, such as the United States Medical Licensing Examination (USMLE) or the Comprehensive Osteopathic Medical Licensing Examination (COMLEX) series<br><br>**Step 3: Complete Residency Training (Typically 3-7 Years)**<br><br><br>▪ Apply to residency programs through the National Resident Matching Program (NRMP)<br><br>▪ Complete a residency program in your chosen medical specialty<br><br>▪ Gain hands-on experience and training under the supervision of experienced physicians<br><br>▪ Develop skills and knowledge specific to your specialty<br><br>**Step 4: Obtain Licensure and Certification**<br><br><br>▪ Obtain a medical license in the state where you plan to practice<br><br>▪ Apply for certification from a professional medical organization, such as the American Board of Internal Medicine (ABIM) or the American Board of Surgery (ABS)<br><br>▪ Maintain certification through ongoing education and professional development<br><br>**Step 5: Pursue Additional Training and Education (Optional)**<br><br><br>▪ Consider pursuing a fellowship program for additional specialized training<br><br>▪ Stay up-to-date with the latest medical research and advancements through continuing education and conferences<br><br>▪ Network with peers and professionals in your field to stay informed and build relationships<br><br>**Additional Tips:**<br><br><br>▪ Gain as much experience as possible through volunteering, shadowing, or working in healthcare settings<br><br>▪ Develop strong communication, teamwork, and problem-solving skills<br><br>▪ Stay organized and manage your time effectively throughout your educational journey<br><br>▪ Pursue a medical specialty that aligns with your interests, skills, and career goals<br><br>Remember, becoming a doctor requires dedication, hard work, and perseverance. Stay focused, and you'll be well on your way to achieving your goal!",
    "feedback": "up"
  },
  {
    "message": "Here's a roadmap to become a civil engineer:<br><br>**Step 1: Meet the Basic Requirements**<br><br><br>▪ Earn a high school diploma or equivalent with a strong foundation in math and science (4 years)<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Take courses in algebra, geometry, trigonometry, and physics<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Maintain a good GPA (3.0 or higher)<br><br>**Step 2: Pursue a Bachelor's Degree in Civil Engineering**<br><br><br>▪ Enroll in a Bachelor of Science in Civil Engineering (B.S.C.E.) program (4 years)<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Complete coursework in:<br>\t\t- Math (calculus, statistics)<br>\t\t- Physics (mechanics, thermodynamics)<br>\t\t- Engineering principles (statics, dynamics, materials science)<br>\t\t- Civil engineering courses (transportation, structures, water resources)<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Participate in internship programs or co-op experiences to gain practical skills<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Network with professors and peers to build connections in the industry<br><br>**Step 3: Gain Practical Experience**<br><br><br>▪ Participate in internships, co-op programs, or research projects (1-2 years)<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Apply theoretical knowledge to real-world problems<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Develop skills in computer-aided design (CAD), Geographic Information Systems (GIS), and other software<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Build a portfolio of projects to showcase skills and experience<br><br>**Step 4: Obtain Professional Certification**<br><br><br>▪ Pass the Fundamentals of Engineering (FE) exam to become an Engineer-in-Training (EIT) (1-2 years)<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Study for the exam through online resources, study groups, or prep courses<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Gain work experience under the supervision of a licensed Professional Engineer (PE)<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Pass the Principles and Practice of Engineering (PE) exam to become a licensed PE<br><br>**Step 5: Stay Up-to-Date with Continuing Education**<br><br><br>▪ Complete continuing education requirements to maintain licensure (every 1-3 years)<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Attend conferences, workshops, and seminars to stay current with industry developments<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Pursue advanced degrees or certifications (e.g., Master's, Ph.D., LEED AP)<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Join professional organizations (e.g., ASCE, NSPE) to network and access resources<br><br>**Step 6: Pursue Advanced Degrees or Certifications (Optional)**<br><br><br>▪ Consider pursuing a Master's or Ph.D. in Civil Engineering for advanced research or academia<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Focus on a specific area of interest, such as structural engineering, transportation engineering, or water resources<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Network with peers and professors to build connections in the industry<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Pursue certifications like LEED AP (Leadership in Energy and Environmental Design Accredited Professional) or PE (Professional Engineer)<br><br>**Additional Tips:**<br><br><br>▪ Stay organized, focused, and committed to your goals<br><br>▪ Build a strong support network of mentors, peers, and professors<br><br>▪ Stay curious, adaptable, and open to new technologies and innovations<br><br>▪ Join professional organizations and attend industry events to stay connected and informed",
    "feedback": "up"
  },
  {
    "message": "Here's a roadmap to help you become a fashion designer:<br><br>**Step 1: Develop Your Skills**<br><br><br>▪ Learn the fundamentals of art, design, and textiles through online courses, books, or workshops<br><br>▪ Practice drawing, sketching, and rendering garments<br><br>▪ Develop your understanding of color theory, fabric science, and pattern making<br><br>**Step 2: Get Formal Education**<br><br><br>▪ Pursue a degree in fashion design or a related field from a reputable institution<br><br>▪ Look for programs that offer internships, mentorship, or industry connections<br><br>▪ Consider earning a master's degree or certification to specialize in a particular area (e.g., sustainable fashion, fashion technology)<br><br>**Step 3: Build Your Portfolio**<br><br><br>▪ Create a professional portfolio showcasing your designs, sketches, and stories<br><br>▪ Include variations of garments, such as different fabrics, colors, and styles<br><br>▪ Highlight your understanding of fashion trends, consumer behavior, and marketing strategies<br><br>**Step 4: Gain Practical Experience**<br><br><br>▪ Intern with a fashion brand, magazine, or textile company to gain hands-on experience<br><br>▪ Participate in design competitions, fashion shows, or exhibitions to build your network and showcase your work<br><br>▪ Consider starting your own fashion label or collaborating with friends on a small scale<br><br>**Step 5: Network and Join Professional Associations**<br><br><br>▪ Attend industry events, conferences, and trade shows to connect with professionals and stay updated on industry trends<br><br>▪ Join professional associations, such as the Council of Fashion Designers of America (CFDA) or the International Federation of Fashion Designers (IFFD)<br><br>▪ Participate in online forums, social media groups, or Reddit communities to connect with fellow designers and stay informed<br><br>**Step 6: Stay Up-to-Date with Industry Trends and Technologies**<br><br><br>▪ Follow industry leaders, bloggers, and influencers on social media to stay informed about the latest trends<br><br>▪ Attend workshops, seminars, and online courses to stay updated on new technologies, software, and techniques<br><br>▪ Participate in hackathons, design challenges, or competitions to innovate and showcase your skills<br><br>**Step 7: Specialize or Pivot**<br><br><br>▪ Consider specializing in a particular area, such as sustainable fashion, menswear, or women's wear<br><br>▪ Be open to pivoting or exploring new areas, such as fashion technology, styling, or branding<br><br>**Step 8: Pursue Opportunities and Career Advancement**<br><br><br>▪ Apply for job openings at fashion companies, or consider freelance or contract work<br><br>▪ Look for opportunities to work with influencers, celebrities, or brands<br><br>▪ Set career goals and create a plan to achieve them, whether it's to become a lead designer, creative director, or entrepreneur<br><br>Remember, becoming a fashion designer requires dedication, hard work, and continuous learning. Focus on building your skills, network, and portfolio to achieve success in this competitive industry.",
    "feedback": "up"
  },
  {
    "message": "Here is a comprehensive roadmap to help you become an IAS officer:<br><br>**Step 1: Meet the Eligibility Criteria (Age 21-30)**<br><br><br>▪ Check the official notification for the UPSC Civil Services Examination (CSE) for the eligibility criteria<br><br>▪ Ensure you meet the age limit (21-30 years), educational qualifications, and nationality requirements<br><br>▪ Check if you have a valid Bachelor's degree from a recognized university<br><br>**Step 2: Choose Your Optional Subject (Age 21-22)**<br><br><br>▪ Select one optional subject from the UPSC-approved list for the IAS exam<br><br>▪ Prepare well for your optional subject, as it will be tested in the Main Exam<br><br>**Step 3: Start Preparing for the Preliminary Exam (Age 21-22)**<br><br><br>▪ Start preparing for the UPSC Civil Services Examination (CSE) Preliminary Exam<br><br>▪ Focus on current affairs, general studies, and CSAT (Civil Services Aptitude Test)<br><br>▪ Prepare for the Preliminary Exam with a good study material and online resources<br><br>**Step 4: Clear the Preliminary Exam (Age 22-23)**<br><br><br>▪ Appear for the UPSC CSE Preliminary Exam, consisting of two papers: GS Paper I and CSAT<br><br>▪ Clear the Preliminary Exam to qualify for the Main Exam<br><br>**Step 5: Prepare for the Main Exam (Age 23-24)**<br><br><br>▪ Prepare for the UPSC CSE Main Exam, consisting of nine papers:<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Essay Paper<br>\t<br>&nbsp;&nbsp;&nbsp;➤ General Studies Papers I to IV<br>\t<br>&nbsp;&nbsp;&nbsp;➤ Optional Subject Papers I and II<br>\t<br>&nbsp;&nbsp;&nbsp;➤ English Language and Comprehension<br><br>▪ Focus on your optional subject and general studies topics<br><br>▪ Prepare for the Main Exam with a good study material and online resources<br><br>**Step 6: Clear the Main Exam (Age 24-25)**<br><br><br>▪ Appear for the UPSC CSE Main Exam<br><br>▪ Clear the Main Exam to qualify for the Personality Test<br><br>**Step 7: Prepare for the Personality Test (Age 25-26)**<br><br><br>▪ Prepare for the UPSC CSE Personality Test, also known as the Interview<br><br>▪ Focus on your communication skills, personality, and integrity<br><br>▪ Prepare to answer questions on your background, interests, and motivations<br><br>**Step 8: Clear the Personality Test (Age 26)**<br><br><br>▪ Appear for the UPSC CSE Personality Test<br><br>▪ Clear the Personality Test to become an IAS officer<br><br>**Additional Tips and Reminders**<br><br><br>▪ Maintain a healthy lifestyle and time management to cope with the pressure of the exam<br><br>▪ Join a good coaching institute or online course to get guidance from experienced faculty<br><br>▪ Stay updated with current affairs and news to improve your general knowledge<br><br>▪ Focus on your weak areas and practice consistently to improve your performance<br><br>▪ Stay motivated and positive throughout the preparation journey<br><br>**Timeframe:**<br><br><br>▪ Age 21-22: Start preparing for the Preliminary Exam<br><br>▪ Age 22-23: Clear the Preliminary Exam<br><br>▪ Age 23-24: Prepare for the Main Exam<br><br>▪ Age 24-25: Clear the Main Exam<br><br>▪ Age 25-26: Prepare for the Personality Test<br><br>▪ Age 26: Clear the Personality Test and become an IAS officer<br><br>**Remember:*<br>▪ The journey to becoming an IAS officer requires dedication, hard work, and perseverance. Stay focused, and you will be well on your way to achieving your goal!",
    "feedback": "up"
  },
  {
    "message": "Here's a roadmap to help you become a doctor:<br><br>**Step 1: Meet the Basic Requirements**<br><br><br>▪ Earn a high school diploma or equivalent with a strong focus on science, mathematics, and English<br><br>▪ Take Advanced Placement (AP) or International Baccalaureate (IB) courses in biology, chemistry, and physics if available<br><br>▪ Maintain a high GPA (3.5 or higher)<br><br>**Step 2: Pursue Higher Education**<br><br><br>▪ Enroll in a pre-medical or science-related undergraduate program (4-5 years)<br><br>▪ Complete a bachelor's degree in a science-related field, such as biology, chemistry, or physics<br><br>▪ Take the Medical College Admission Test (MCAT) during your junior or senior year<br><br>**Step 3: Attend Medical School**<br><br><br>▪ Apply to medical schools approved by the Liaison Committee on Medical Education (LCME)<br><br>▪ Complete a Doctor of Medicine (M.D.) or Doctor of Osteopathic Medicine (D.O.) program (4 years)<br><br>▪ Participate in clinical rotations and gain hands-on experience in various medical specialties<br><br>**Step 4: Complete Residency Training**<br><br><br>▪ Apply for residency programs through the National Resident Matching Program (NRMP)<br><br>▪ Complete a residency program in your chosen medical specialty (3-7 years)<br><br>▪ Gain practical experience and develop expertise in your chosen field<br><br>**Step 5: Obtain Licensure and Certification**<br><br><br>▪ Pass the United States Medical Licensing Examination (USMLE) or the Comprehensive Osteopathic Medical Licensing Examination (COMLEX) series<br><br>▪ Obtain a medical license in the state where you plan to practice<br><br>▪ Pursue board certification in your medical specialty through the American Board of Medical Specialties (ABMS) or the American Osteopathic Association (AOA)<br><br>**Step 6: Pursue Additional Training and Stay Up-to-Date**<br><br><br>▪ Consider pursuing a fellowship program for advanced training in your medical specialty<br><br>▪ Stay current with the latest medical research, technologies, and guidelines through ongoing education and professional development<br><br>▪ Join professional organizations and attend conferences to network with peers and stay updated on industry developments<br><br>**Additional Tips:**<br><br><br>▪ Gain research experience and publish papers in reputable medical journals<br><br>▪ Develop strong communication and interpersonal skills through patient interactions and teamwork<br><br>▪ Build a strong network of mentors and peers in the medical community<br><br>▪ Stay organized and manage your time effectively to balance academic and clinical responsibilities<br><br>**Timeline:**<br><br><br>▪ High school: 4 years<br><br>▪ Undergraduate program: 4-5 years<br><br>▪ Medical school: 4 years<br><br>▪ Residency training: 3-7 years<br><br>▪ Licensure and certification: 1-2 years<br><br>▪ Ongoing education and professional development: Ongoing<br><br>Remember, becoming a doctor requires dedication, hard work, and a strong passion for medicine. Stay focused, and you'll be well on your way to achieving your goal!",
    "feedback": "up"
  }
]